#!usr/bin/env python3.6  
#-*- coding:utf-8 -*-  
""" 
@author:iBoy 
@file: test.py 
@time: 2017/05/22 
"""

str = '''<p>

 قال شهود عيان الجمعة إن متظاهرين في مدينة لاهاسا، عاصمة التبت، أضرموا النار في عدد من المركبات ورشقوا الشرطة بالحجارة، فيما ردت قوات الأمن بإطلاق غاز مسيل للدموع وبعض الطلقات النارية، وفقا لوكالة الأنباء الرسمية الصينية.
 </p>وخرج نحو ألف متظاهر غاضب إلى شوارع العصمة لاهاسا، وأتلفوا محالا تجارية ومركبات يملكها أشخاص ينتمون إلى طائفة هان، وهي الطائفة العرقية'''

print(str + '\n')

# str = ''.join(str.split())
str.strip()
str = str.replace('\n', '')
print(str)